brew "bash-completion"
brew "diff-so-fancy"
brew "git"
brew "git-lfs"
brew "gpg"
brew "httpie"
brew "jq"
brew "mas"
brew "neovim"
brew "node"
brew "python"
brew "shellcheck"
brew "thefuck"
brew "tldr"
brew "wget"
brew "youtube-dl"
brew "z"
brew "zsh"

# Browsers
cask_args appdir: "/Applications"
cask "firefox"
cask "caskroom/versions/firefoxdeveloperedition"
cask "google-chrome"
cask "caskroom/versions/google-chrome-canary"
cask "caskroom/versions/safari-technology-preview"

# Global Apps
cask_args appdir: "/Applications"
cask "1password"
cask "little-snitch"
cask "vmware-fusion"

# Regular Apps
cask_args appdir: "~/Applications"
cask "banktivity"
cask "charles"
cask "chatology"
cask "colorpicker-skalacolor"
cask "daisydisk"
cask "dropshare"
cask "encryptme"
cask "handbrake"
cask "iina"
cask "imageoptim"
cask "kaleidoscope"
cask "micro-snitch"
cask "now"
cask "paw"
cask "pdfpenpro"
cask "qlmarkdown"
cask "qlstephen"
cask "quicklook-json"
cask "resilio-sync"
cask "screens"
cask "sketch"
cask "steam"
cask "suspicious-package"
cask "tower"
cask "transmit"
cask "transmission"
cask "visual-studio-code"

# App Store
mas "1Blocker", id: 1107421413
mas "Contrast", id: 1254981365
mas "Day One", id: 1055511498
mas "Deliveries", id: 924726344
mas "DxOOpticsProForPhotos", id: 1056077392
mas "Fantastical 2", id: 975937182
mas "iA Writer", id: 775737590
mas "Keynote", id: 409183694
mas "MacFamilyTree 8", id: 1037755919
mas "Name Mangler 3", id: 603637384
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Paprika Recipe Manager 3", id: 1303222628
mas "Pixelmator Pro", id: 1289583905
mas "Reeder", id: 880001334
mas "Slack", id: 803453959
mas "Soulver", id: 413965349
mas "Textual 7", id: 1262957439
mas "Things 3", id: 904280696
mas "Tweetbot", id: 557168941
mas "The Unarchiver", id: 425424353
mas "Xcode", id: 497799835
